Python 3.12.5 (tags/v3.12.5:ff3bc82, Aug  6 2024, 20:45:27) [MSC v.1940 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

=============== RESTART: C:/Users/user/Documents/새 폴더/dongARI.EXE ==============
Traceback (most recent call last):
  File "C:/Users/user/Documents/새 폴더/dongARI.EXE", line 1, in <module>
    from flask import Flask, render_template, request, redirect, session, jsonify
ModuleNotFoundError: No module named 'flask'

=============== RESTART: C:/Users/user/Documents/새 폴더/dongARI.EXE ==============
학습할 모드를 선택하세요 (ひらがな / カタカナ): hiragana
⚠️ 잘못된 입력입니다. 'ひらがな' 또는 'カタカナ'를 입력하세요.
학습할 모드를 선택하세요 (ひらがな / カタカナ): カタカナ

📚 'カタカナ' 학습을 시작합니다! (종료하려면 'exit' 입력)

'オ'의 발음을 입력하세요 (종료: 'exit'): o
✅ 정답입니다!

'ア'의 발음을 입력하세요 (종료: 'exit'): a
✅ 정답입니다!

'タ'의 발음을 입력하세요 (종료: 'exit'): ke
❌ 오답! 정답은 'ta'입니다.

'エ'의 발음을 입력하세요 (종료: 'exit'): e
✅ 정답입니다!

'イ'의 발음을 입력하세요 (종료: 'exit'): i
✅ 정답입니다!

'ソ'의 발음을 입력하세요 (종료: 'exit'): ?
❌ 오답! 정답은 'so'입니다.

'ス'의 발음을 입력하세요 (종료: 'exit'): su
✅ 정답입니다!

'ツ'의 발음을 입력하세요 (종료: 'exit'): si
❌ 오답! 정답은 'tsu'입니다.

'ク'의 발음을 입력하세요 (종료: 'exit'): ku
✅ 정답입니다!

'シ'의 발음을 입력하세요 (종료: 'exit'): exit

📢 학습 종료! 정답 개수: 6, 오답 개수: 3

========================= RESTART: C:/Users/user/Documents/새 폴더/dongARI.EXE =========================
학습할 모드를 선택하세요 (ひらがな / カタカナ): ひらがな

📚 'ひらがな' 학습을 시작합니다! (종료하려면 'exit' 입력)

'こ'의 발음을 입력하세요 (종료: 'exit'): ko
✅ 정답입니다!

'そ'의 발음을 입력하세요 (종료: 'exit'): so
✅ 정답입니다!

'あ'의 발음을 입력하세요 (종료: 'exit'): dk
❌ 오답! 정답은 'a'입니다.

'か'의 발음을 입력하세요 (종료: 'exit'): ka
✅ 정답입니다!

'の'의 발음을 입력하세요 (종료: 'exit'): no
✅ 정답입니다!

'ぬ'의 발음을 입력하세요 (종료: 'exit'): me
❌ 오답! 정답은 'nu'입니다.

'つ'의 발음을 입력하세요 (종료: 'exit'): tzu
❌ 오답! 정답은 'tsu'입니다.

'せ'의 발음을 입력하세요 (종료: 'exit'): se
✅ 정답입니다!

'こ'의 발음을 입력하세요 (종료: 'exit'): ko
✅ 정답입니다!

'え'의 발음을 입력하세요 (종료: 'exit'): e
✅ 정답입니다!

'さ'의 발음을 입력하세요 (종료: 'exit'): exit

📢 학습 종료! 정답 개수: 7, 오답 개수: 3
ひらがな
Traceback (most recent call last):
  File "<pyshell#0>", line 1, in <module>
    ひらがな
NameError: name 'ひらがな' is not defined

========================= RESTART: C:/Users/user/Documents/새 폴더/dongARI.EXE =========================

학습할 모드를 선택하세요 ('히라가나' 또는 '가타카나') 또는 '종료' 입력: 가타카나

📚 '가타카나' 학습을 시작합니다! (종료하려면 'exit' 입력)

'ネ'의 발음을 입력하세요 (종료: 'exit'): 네
✅ 정답입니다!

'エ'의 발음을 입력하세요 (종료: 'exit'): 에
✅ 정답입니다!

'ヌ'의 발음을 입력하세요 (종료: 'exit'): ㅇ
❌ 오답! 정답은 '누'입니다.

'イ'의 발음을 입력하세요 (종료: 'exit'): 이
✅ 정답입니다!

'ノ'의 발음을 입력하세요 (종료: 'exit'): 노
✅ 정답입니다!

'ナ'의 발음을 입력하세요 (종료: 'exit'): 
❌ 오답! 정답은 '나'입니다.

'ニ'의 발음을 입력하세요 (종료: 'exit'): 코
❌ 오답! 정답은 '니'입니다.

'キ'의 발음을 입력하세요 (종료: 'exit'): 키
✅ 정답입니다!

'ソ'의 발음을 입력하세요 (종료: 'exit'): 응
❌ 오답! 정답은 '소'입니다.

'セ'의 발음을 입력하세요 (종료: 'exit'): 세
✅ 정답입니다!

'エ'의 발음을 입력하세요 (종료: 'exit'): 에
✅ 정답입니다!

'コ'의 발음을 입력하세요 (종료: 'exit'): 코
✅ 정답입니다!

'セ'의 발음을 입력하세요 (종료: 'exit'): 세
✅ 정답입니다!

'ヌ'의 발음을 입력하세요 (종료: 'exit'): 누
✅ 정답입니다!

'タ'의 발음을 입력하세요 (종료: 'exit'): 타
✅ 정답입니다!

'タ'의 발음을 입력하세요 (종료: 'exit'): 타
✅ 정답입니다!

'サ'의 발음을 입력하세요 (종료: 'exit'): 사
✅ 정답입니다!

'ケ'의 발음을 입력하세요 (종료: 'exit'): exit

📢 학습 종료! 정답 개수: 13, 오답 개수: 4


